<?php
/*******************************************************************************************
*   ___  _          ______                     _ _                _                        *
*  / _ \| |         | ___ \                   | (_)              | |              © 2023   *
* / /_\ | | _____  _| |_/ /_ __ __ _ _ __   __| |_ _ __   __ _   | |_ ___  __ _ _ __ ___   *
* |  _  | |/ _ \ \/ / ___ \ '__/ _` | '_ \ / _` | | '_ \ / _` |  | __/ _ \/ _` | '_ ` _ \  *
* | | | | |  __/>  <| |_/ / | | (_| | | | | (_| | | | | | (_| |  | ||  __/ (_| | | | | | | *
* \_| |_/_|\___/_/\_\____/|_|  \__,_|_| |_|\__,_|_|_| |_|\__, |  \___\___|\__,_|_| |_| |_| *
*                                                         __/ |                            *
*                                                        |___/                             *
* ---------------------------------------------------------------------------------------- *
* This is commercial software, only users who have purchased a valid license and accept    *
* to the terms of the License Agreement can install and use this program.                  *
* ---------------------------------------------------------------------------------------- *
* website: https://cs-cart.alexbranding.com                                                *
*   email: info@alexbranding.com                                                           *
*******************************************************************************************/
$addon = basename(__FILE__, '.php');
$schema = [
'config' => [
'addon' => $addon,
'data' => [
[
'set' => 'AB: Product Set 1',
'pos' => 1,
'ru' => [
'set' => 'AB: Комплект товаров 1',
],
],
[
'set' => 'AB: Product Set 2',
'pos' => 2,
'ru' => [
'set' => 'AB: Комплект товаров 2',
],
],
],
],
'steps' => [
'install_demodata' => [
['fn_ab__ps_install_demodata', '@data'],
],
],
];
return $schema;
